from aiogram import types, F
from aiogram.fsm.context import FSMContext
from aiogram import Router

import logging

from bot.functions import inline_keyboard


router = Router()


@router.message(F.text == "💰 Вартість та склад")
async def init(message: types.Message) -> None:
    logging.info(f"About | User ID and Name: {message.from_user.id}, {message.from_user.username}")


    await message.answer(
"""<b>📏 Стандартні розміри:</b>
    • Гігантська - 200 см (з більшої сторони) - вартість <s>5500 грн</s> <i>Для підписників каналу</i> <b>2750 грн</b>
    • Найбільша - 150 см (з більшої сторони) - вартість <s>4300 грн</s> <i>Для підписників каналу</i> <b>2150 грн</b>
    • Велика - 100 см (з більшої сторони) - вартість <s>2700 грн</s> <i>Для підписників каналу</i> <b>1350 грн</b>
    • Середня - 65 см (з більшої сторони) - вартість <s>1700 грн</s> <i>Для підписників каналу</i> <b>850 грн</b>
    • Маленька - 35 см (з більшої сторони) - вартість <s>900 грн</s> <i>Для підписників каналу</i> <b>450 грн</b>

<b>🛏 Склад подушки:</b>
    1️⃣ Тканина – габардин: м’яка, приємна на дотик, легко переться.
    2️⃣ Наповнювач – холофайбер високої якості.

<b>🌀 Легко доглядати:</b>
    🌊 Подушку можна прати в пральній машині при 30°. Після прання потрібно висушити подушку і розподіліть холофайбер!""",
        reply_markup=inline_keyboard.create(('🌟 Створити подушку', 'upload_pil'), ('❓ В мене є питання', 'question_to_manager'))
    )